# 수학
# 정수론
# 누적 합
# 유클리드 호제법


# 문제: https://www.acmicpc.net/problem/2725

# 에라토스테네스의 체 활용
# 메모리: 32412KB / 시간: 32ms
from sys import stdin


input = stdin.readline

def main():
    # 🗝️(i, j)에서 i와 j는 서로소 관계여야 함. gcd(i, j) == 1 -> (오일러 피 함수 개념)
    def calc() -> list:
        # phi[i]: 1부터 i까지의 자연수 중에서, i와 서로소인 쌍의 갯수
        phi = list(range(1001))

        for i in range(2, 1001):
            if phi[i] == i:
                # ⭐어떤 수 j가 i로 나누어진다면, j에서 i의 배수들을 제거해야 서로소들만 남게 됨.
                for j in range(i, 1001, i):
                    phi[j] -= phi[j] // i
        
        dp = [0] * 1001
        dp[1] = 3  # (1, 0), (0, 1), (1, 1)
        # 1 ~ i 의 숫자로 만들 수 있는 서로소 쌍의 갯수 == dp[i-1]의 값에 i의 서로소 * 2를 더해준 값.
        # -> 만약 i = 5, i의 서로소가 1, 2, 3이라면 (1, 5), (5, 1)... 모두 가능하므로 *2를 해줘야 함.
        for i in range(2, 1001):
            dp[i] = dp[i-1] + phi[i] * 2
        
        return dp
    

    dp = calc()

    for _ in range(int(input())):
        print(dp[int(input())])


main()