# 다이나믹 프로그래밍
# 그래프 이론


# 문제: https://www.acmicpc.net/problem/2780

# DP 연습용으로 다시 풀어볼만한 문제
# 메모리: 33432KB / 시간: 36ms
from sys import stdin


input = stdin.readline
MOD = 1234567


def main():
    # 처음엔 메모이제이션+DFS로 풀려고 했으나... DP로 풀면 훨씬 간단함.
    # 어차피 경로/규칙이 명확하게 정해져있기 때문임.
    numbers = [[7], [2, 4], [1, 3, 5], [2, 6], [1, 5, 7], [2, 4, 6, 8],
               [3, 5, 9], [4, 8, 0], [5, 7, 9], [6, 8]]
    
    # 효율을 위해 dp[num][길이] 형태로 저장함.
    # dp[num][i]: 길이가 i고 num으로 끝나는 경우의 수
    dp = [[0] * 1001 for _ in range(10)]

    # 길이가 1일때에는 모두 1개씩만 가능
    for i in range(10):
        dp[i][1] = 1
    
    # 반복문 돌릴때에는 i -> num 순서로 가야 안전함.
    # 이전 길이의 값(i-1)을 참조하기 때문.
    for i in range(2, 1001):
        for num in range(10):
            for j in numbers[num]:
                # 🚨dp[num][i] += dp[j][i-1] % MOD 로 하면 dp[j][i-1]에만 MOD를 취하게 됨.
                dp[num][i] = (dp[num][i] + dp[j][i-1]) % MOD
    
    T = int(input())

    for _ in range(T):
        N = int(input())
        total = sum(dp[i][N] for i in range(10)) % MOD

        print(total)


main()