# 그리디 알고리즘
# 정렬


# 문제: https://www.acmicpc.net/problem/2785
# 참고👉 https://simple0710.tistory.com/69

# 생각보다 헤맸던 문제...ㅜㅜ
# 🗝️길이가 x인 체인을 풀면 필요한 고리는 1개 줄어들고 x개의 고리를 획득할 수 있음.
# -> 이걸 x개 줄어듦 + 고리 x개 획득으로 계산해버림.

# 나중에 다시 풀어볼만한 그리디 문제.

# 메모리: 83492KB / 시간: 272ms
from sys import stdin


input = stdin.readline

def main():
    N = int(input())
    chains = sorted(map(int, input().split()))

    # N개의 체인을 연결하려면 최소 N-1개의 고리가 필요함.
    ret = N - 1
    cnt = 0

    # cnt는 고리화 시킨 체인 갯수.
    # 길이가 짧은 체인부터 하나씩 풀어서 고리로 만듦.
    # 체인을 풀어 만든 고리의 갯수 == cnt
    # 현재 필요한 고리의 갯수 == ret

    # 현재 체인을 고리로 만들면, 이 체인을 연결하기 위한 고리 하나는 필요없어짐.
        # ex) 00 x 0 x 0 x 0 (0: 체인, x: 고리가 필요한 공간)일때 000을 풀면 우측의 고리는 필요 X
        # 따라서 필요한 고리의 갯수를 -1 카운트. 또한 체인을 고리화 했으니 cnt는 += 2 처리해줌.
    
    for chain in chains:
        # 만약 현재까지 만든 고리 + 현재 체인을 풀어 만들 수 있는 고리의 갯수 >= 필요한 고리 갯수
        # 를 만족하면 break
        if cnt + chain >= ret:
            break
        cnt += chain
        ret -= 1
    
    print(ret)


main()