# 그리디 알고리즘
# 정렬


# 문제: https://www.acmicpc.net/problem/2790

# 처음엔 딕셔너리로 {점수: 선수 수} 저장.
# 푸는 로직은 같아서 답은 맞았으나, 걍 리스트로 0부터 N-1까지 쭉 더하는게 더 빠름.
# 다시 풀어봐도 좋을 문제~

# 메모리: 46364KB / 시간: 288ms
from sys import stdin


input = stdin.readline

def main():
    N = int(input())

    # 선수들의 점수를 오름차순으로 정렬
    score = sorted(int(input()) for _ in range(N))
    max_score = 0
    cnt = 0

    # 🗝️각 선수가 우승하려면 다른 선수들이 받을 수 있는 최대 점수를 고려해야함.
    # i번째 선수가 우승하려면, 자신보다 점수가 높은 선수들을 이겨야함.
    # 즉 자신보다 점수가 낮은 선수들에겐 높은 등수를, 높은 선수들에겐 높을수록 더 낮은 등수를 줘야됨.
    
    # 오름차순 정렬 후 점수가 낮은 선수부터 차례대로 (N - i)점을 부여.
    # 부여한 각 점수는, (낮은 선수-높은 등수, 높은 선수-낮은 등수) 규칙을 만족하면서 만들 수 있는 가장 최고점이 됨.
    # 예를들어 [1, 3, 3, 3, 4]일때, 3의 최고점은 7, 6, 5점이 됨. 따라서 1은 우승 불가.
    for i in range(N):
        curr = score[i] + (N - i)
        if curr > max_score:
            max_score = curr

    for i in range(N):
        # 현재 선수에게 N점을 추가했을때 최고점 이상이라면 우승 가능
        target = score[i] + N
        if target >= max_score:
            cnt += 1
    
    print(cnt)


main()