# 구현
# 자료 구조
# 시뮬레이션
# 집합과 맵
# 해시를 사용한 집합과 맵


# 문제: https://www.acmicpc.net/problem/3237
# 메모리: 35000KB / 시간: 160ms
from sys import stdin


input = stdin.readline

def main():
    N = int(input())
    # spies[(x, y)]: (x, y)좌표에 위치한 스파이의 번호
    # -> 🚨 3%에서 자꾸 터지길래 찾아보니, 스파이가 한 좌표에 여러명 있을수도 있음. 처리해주니 통과함.
    spies = {}
    for i in range(N):
        pos = tuple(map(int, input().split()))
        spies.setdefault(pos, []).append(i+1)

    # 방향값 맵핑
    direction = {"I": (1, 0), "S": (0, 1), "Z": (-1, 0), "J": (0, -1)}

    # (출제자와 같은 위치 or 인접한 8개의 위치)일 경우 도청 가능하므로, 출제자 좌표도 고려하게끔 (0, 0) 추가.
    dx = [0, 1, 0, -1, 0, 1, 1, -1, -1]
    dy = [0, 0, 1, 0, -1, 1, -1, 1, -1]

    K = int(input())
    # 초기 위치(0, 0)에서부터 도청할수도 있으므로 맨 앞에 추가.
    tester = [(0, 0)] + [direction[d] for d in input().rstrip()]
    x = y = 0

    ret = set()

    for r, c in tester:
        x += r
        y += c

        for i in range(9):
            nx, ny = x + dx[i], y + dy[i]

            # 이동한 좌표 주변으로 스파이가 있다면, 해당 스파이의 번호 추가
            if (nx, ny) in spies:
                # 해당 좌표에 있는 스파이가 여러명일경우 리스트 형태이므로 set()변환 후 합집합.
                # -> ❗참고로 add는 불가능하다. set에는 mutable한 객체는 못 들어가기 때문. (int, str, tuple 같은건 가능)
                ret |= set(spies[(nx, ny)])
    if ret:
        print(*sorted(ret), sep="\n")
    else:
        print(-1)


main()